print('"1st program"' )
print(9**0.5*5)
print("----------")
print('"2nd program"')
print(9.99 > 9.98 and 1000 != 1000.1)
print("----------")
print('"3rd program"')
print(2 * 2 + 2)
print(2 * (2 + 2))
print(2 * 2 + 2 == 2 * (2 + 2))
print("----------")
print('"4th program"')
print("'123.456'")
print(float('123.456'))
print(type(float('123.456'))) # проверка, что это ЧИСЛО
print(123.456 * 10) # двигаем 4 в целую часть и выделяем целое число
print(int(1234.56 % 10)) # находим остатот от деления и выводм целое число
print(int(123.456 * 10) % 10) # тоже самое, но в одной формуле
print("----------")